Examinator/src/InformationRegisters/УчебныеБазыСУЗ/УчебныеБазыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчебныеБазыСУЗ</name>
  <attributes>
    <name>СпособПодключения</name>
    <type>
      <types>EnumRef.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindowsИнформационнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИнформационнойБазыНаСервере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресНаВебСервере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.ПрограммныеПродуктыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СпособыПодключенияКВнешнейИнформационнойБазеСУЗ/СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПодключенияКВнешнейИнформационнойБазеСУЗ</name>
  <enumValues>
    <name>Сервер</name>
  </enumValues>
  <enumValues>
    <name>Файл</name>
  </enumValues>
  <enumValues>
    <name>ВебСервер</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/УчебныеБазыСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция НастройкиПодключения(Знач Конфигурация, Знач Пользователь = Неопределено) Экспорт
	
	НаименованиеКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конфигурация, "Наименование");
	
	Если Метаданные.Имя = НаименованиеКонфигурации Тогда
		Возврат Метаданные.Имя; 
	КонецЕсли;
	
	// Получаем переменные
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	// Получаем настройки соединения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчебныеБазыСУЗ.СпособПодключения,
		|	УчебныеБазыСУЗ.АутентификацияWindowsИнформационнойБазы,
		|	УчебныеБазыСУЗ.ИмяИнформационнойБазыНаСервере,
		|	УчебныеБазыСУЗ.ИмяСервераИнформационнойБазы,
		|	УчебныеБазыСУЗ.КаталогИнформационнойБазы,
		|	УчебныеБазыСУЗ.ПарольИнформационнойБазы,
		|	УчебныеБазыСУЗ.ПользовательИнформационнойБазы,
		|	УчебныеБазыСУЗ.АдресНаВебСервере
		|ИЗ
		|	РегистрСведений.УчебныеБазыСУЗ КАК УчебныеБазыСУЗ
		|ГДЕ
		|	УчебныеБазыСУЗ.Конфигурация = &Конфигурация
		|	И УчебныеБазыСУЗ.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ТаблицаНастроек = РезультатЗапроса.Выгрузить();
		
		НастройкиПодключения = Новый Структура;
		
		Для каждого Колонка Из ТаблицаНастроек.Колонки Цикл
			НастройкиПодключения.Вставить(Колонка.Имя, ТаблицаНастроек[0][Колонка.Имя]);		
		КонецЦикла;
		
		Возврат НастройкиПодключения;
		
	КонецЕсли;	
	
КонецФункции

Функция УстановитьПодключение(ДанныеДляОбработкиXML, Знач НастройкиПодключения) Экспорт
	
	РезультатСоединения = Новый Структура("ОшибкаПодключения, ОшибкаПроверки, КраткоеОписаниеОшибки, ПодробноеОписаниеОшибки", Ложь, Ложь, "", "");
	
	// Соединяемся с внешней базой на сервере и получаем результат проверки этапов
	
	Если НастройкиПодключения = Метаданные.Имя Тогда
		
		УчебнаяКонфигурацияСУЗ.ВыполнитьПодключение(ДанныеДляОбработкиXML);
		
	ИначеЕсли НастройкиПодключения.СпособПодключения = Перечисления.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.ВебСервер Тогда
		
		ПараметрыСоединения = ОбщегоНазначенияКлиентСервер.СтруктураURI(НастройкиПодключения.АдресНаВебСервере);
		ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси(ПараметрыСоединения.Схема);
		
		ТаймаутСети = 10;
		
		HTTP = Новый HTTPСоединение(ПараметрыСоединения.Хост,
			ПараметрыСоединения.Порт,
			?(НастройкиПодключения.АутентификацияWindowsИнформационнойБазы, "", НастройкиПодключения.ПользовательИнформационнойБазы),
			?(НастройкиПодключения.АутентификацияWindowsИнформационнойБазы, "", НастройкиПодключения.ПарольИнформационнойБазы),
			ИнтернетПрокси,
			ТаймаутСети,
			?(ПараметрыСоединения.Схема = "https",
				Новый ЗащищенноеСоединениеOpenSSL(),
				Неопределено));
				
		ПараметрыСоединения.ПутьНаСервере = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПараметрыСоединения.ПутьНаСервере);
		
		ПараметрыСоединения.ПутьНаСервере = ПараметрыСоединения.ПутьНаСервере + "hs/learning/v1/check";
		
		HTTPЗапрос = Новый HTTPЗапрос(ПараметрыСоединения.ПутьНаСервере);
		HTTPЗапрос.УстановитьТелоИзСтроки(ДанныеДляОбработкиXML);
		
		Попытка
			
			Ответ = HTTP.ОтправитьДляОбработки(HTTPЗапрос);
			
		Исключение
					
			РезультатСоединения.ОшибкаПодключения = Истина;
			РезультатСоединения.КраткоеОписаниеОшибки = НСтр("ru = 'Произошла ошибка при подключении к учебной базе.
			|Подробное описание ошибки см. в журнале регистрации.'");
			РезультатСоединения.ПодробноеОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ошибка при подключении к учебной базе (%1): %2'"),
				ПараметрыСоединения.ПутьНаСервере, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при подключении к учебной базе'"), УровеньЖурналаРегистрации.Ошибка,,,РезультатСоединения.ПодробноеОписаниеОшибки);
			
			Возврат РезультатСоединения;
			
		КонецПопытки;
		
		Если Ответ.КодСостояния <> 200 Тогда
			
			РезультатСоединения.ОшибкаПроверки = Истина;
			РезультатСоединения.КраткоеОписаниеОшибки = НСтр("ru = 'Произошла ошибка проверки задания.
			|Подробное описание ошибки см. в журнале регистрации.'");
			РезультатСоединения.ПодробноеОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ошибка при подключении к учебной базе (%1): %2.'"),
				Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
				
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка проверки задания пользователя во внешней базе'"), УровеньЖурналаРегистрации.Ошибка,,,РезультатСоединения.ПодробноеОписаниеОшибки);
				
			Возврат РезультатСоединения;
			
		КонецЕсли;
		
		ДанныеДляОбработкиXML = Ответ.ПолучитьТелоКакСтроку();
		
	Иначе
		
		НастройкиСоединения = Новый Структура(
		"ВариантРаботыИнформационнойБазы,
		|КаталогИнформационнойБазы,
		|ИмяСервера1СПредприятия,
		|ИмяИнформационнойБазыНаСервере1СПредприятия,
		|АутентификацияОперационнойСистемы,
		|ИмяПользователя,
		|ПарольПользователя",
		?(НастройкиПодключения.СпособПодключения = Перечисления.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.Сервер, 1, 0),
		НастройкиПодключения.КаталогИнформационнойБазы,
		НастройкиПодключения.ИмяСервераИнформационнойБазы,
		НастройкиПодключения.ИмяИнформационнойБазыНаСервере,
		НастройкиПодключения.АутентификацияWindowsИнформационнойБазы,
		НастройкиПодключения.ПользовательИнформационнойБазы,
		НастройкиПодключения.ПарольИнформационнойБазы);
		
		НастройкиСоединения = ОбщегоНазначения.УстановитьВнешнееСоединениеСБазой(НастройкиСоединения);
		
		Если НастройкиСоединения.ОшибкаПодключенияКомпоненты Тогда
			
			РезультатСоединения.ОшибкаПодключения = Истина;
			РезультатСоединения.КраткоеОписаниеОшибки = НастройкиСоединения.КраткоеОписаниеОшибки;
			РезультатСоединения.ПодробноеОписаниеОшибки = НастройкиСоединения.ПодробноеОписаниеОшибки;
			
			Возврат РезультатСоединения;
			
		КонецЕсли;
		
		Попытка
			 
			// УчебнаяКонфигурацияСУЗ.ВыполнитьПодключение(ДанныеДляОбработкиXML);
			НастройкиСоединения.Соединение.УчебнаяКонфигурацияСУЗ.ВыполнитьПодключение(ДанныеДляОбработкиXML);
			
		Исключение
			
			РезультатСоединения.ОшибкаПроверки = Истина;
			РезультатСоединения.КраткоеОписаниеОшибки = НСтр("ru = 'Произошла ошибка проверки задания.
			|Подробное описание ошибки см. в журнале регистрации.'");
			РезультатСоединения.ПодробноеОписаниеОшибки = НСтр("ru = 'Ошибка подключения к учебной базе:'") + Символы.ПС + ОписаниеОшибки();
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка проверки задания пользователя во внешней базе'"), УровеньЖурналаРегистрации.Ошибка,,,РезультатСоединения.ПодробноеОписаниеОшибки);
			
			Возврат РезультатСоединения;
			
		КонецПопытки;
			
	КонецЕсли;
	
	Возврат РезультатСоединения;
	
КонецФункции

#КонецЕсли
